soap_add_item.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:soap1="http://guidewire.com/ws/soapheaders" xmlns:san="http://www.sancristobal.com.ar">
   <soap:Header>
      <soap:gw_locale>es_AR</soap:gw_locale>
      <soap:gw_language>es_AR</soap:gw_language>
      <soap1:authentication>
         <soap1:username>{{username}}</soap1:username>
         <soap1:password>{{password}}</soap1:password>
      </soap1:authentication>
   </soap:Header>
   <soap:Body>
      <san:addItemToProducerPromise>
         <san:publicIdPromise>{{publicIdPromise}}</san:publicIdPromise>
         <san:policyNumber>{{policyNumber}}</san:policyNumber>
         <san:valueAmount>{{valueAmount}}</san:valueAmount>
         <san:nroCuota>{{nroCuota}}</san:nroCuota>
      </san:addItemToProducerPromise>
   </soap:Body>
</soap:Envelope>
